

//-----------------------------------------------------------------------------------
// INCLUDE
//-----------------------------------------------------------------------------------
#include "Local.h"
#include "Class/Common/Render/Map/CMapFrame.h"
#include "Class/Common/Render/Map/CMapModel.h"
#include "Interface/Render/3D/ILinePrimitive3D.h"


//-----------------------------------------------------------------------------------
// NAMESPACE
//-----------------------------------------------------------------------------------
using namespace Selene;
using namespace Renderer;
using namespace Object;


//-----------------------------------------------------------------------------------
/**
*/
//-----------------------------------------------------------------------------------
CMapFrame::CMapFrame()
	: m_MeshIndex	( -1 )
{
	SetName( "フレーム" );

	for ( Sint32 x = 0; x < 2; x++ )
	{
		for ( Sint32 y = 0; y < 2; y++ )
		{
			for ( Sint32 z = 0; z < 2; z++ )
			{
				m_pChild[x][y][z] = NULL;
			}
		}
	}
}

//-----------------------------------------------------------------------------------
/**
*/
//-----------------------------------------------------------------------------------
CMapFrame::~CMapFrame()
{
}

//-----------------------------------------------------------------------------------
/*
*/
//-----------------------------------------------------------------------------------
void CMapFrame::ConnectChildFrame( Sint32 x, Sint32 y, Sint32 z, CMapFrame *pFrame )
{
	m_pChild[x][y][z] = pFrame;
}

//-----------------------------------------------------------------------------------
/*
*/
//-----------------------------------------------------------------------------------
void CMapFrame::ConnectMesh( Sint32 Index )
{
	m_MeshIndex = Index;
}

//-----------------------------------------------------------------------------------
/*
*/
//-----------------------------------------------------------------------------------
Sint32 CMapFrame::GetConnectMesh( void )
{
	return m_MeshIndex;
}

//-----------------------------------------------------------------------------------
/**
*/
//-----------------------------------------------------------------------------------
void CMapFrame::SetBounding( const Math::Vector3D &vMin, const Math::Vector3D &vMax )
{
	m_OBB.CreateBox( vMin, vMax, Math::Matrix::GetIdentity() );
	m_vMin = vMin;
	m_vMax = vMax;
}

//-----------------------------------------------------------------------------------
/*
*/
//-----------------------------------------------------------------------------------
void CMapFrame::RenderingTree( Scene::CCamera &Camera )
{
	// ビューフラスタムカリング
	if ( Camera.ViewfrustumCulling( m_OBB ) )
	{
		// 子供をレンダリング
		for ( Sint32 x = 0; x < 2; x++ )
		{
			for ( Sint32 y = 0; y < 2; y++ )
			{
				for ( Sint32 z = 0; z < 2; z++ )
				{
					if ( m_pChild[x][y][z] != NULL )
					{
						m_pChild[x][y][z]->RenderingTree( Camera );
					}
				}
			}
		}

		// 所持メッシュをレンダリング
		if ( m_MeshIndex != -1 )
		{
			CMapModel *pModel = (CMapModel*)GetParent();
			pModel->SetMeshDrawEnable( m_MeshIndex );
		}
	}
}

//-----------------------------------------------------------------------------------
/*
*/
//-----------------------------------------------------------------------------------
void CMapFrame::RenderingBounding( Renderer::Object::ILine3D *pLine )
{
	pLine->PushBox( m_OBB, CColor(255,64,255) );
}

