#pragma once


//-----------------------------------------------------------------------------------
// INCLUDE
//-----------------------------------------------------------------------------------
#include "Base.h"
#include "Interface/IInterface.h"


//-----------------------------------------------------------------------------------
// NAMESPACE
//-----------------------------------------------------------------------------------
namespace Selene
{
namespace Renderer
{
namespace Object
{
	/**
		@brief モデルデータ用インターフェイス
		@author 葉迩倭

		@note
		モデルデータを保持するためのインターフェイスです。
	*/
	class IModel : public IInterface
	{
	public:
		virtual ~IModel() {}
	};
}
}
}

