

//-----------------------------------------------------------------------------------
// INCLUDE
//-----------------------------------------------------------------------------------
#include "Class/Common/Object/CResourceObjectMgr.h"
#include "Local.h"


//-----------------------------------------------------------------------------------
// NAMESPACE
//-----------------------------------------------------------------------------------
using namespace Selene;


//-----------------------------------------------------------------------------------
/**
*/
//-----------------------------------------------------------------------------------
CResourceObjectMgr::CResourceObjectMgr( const char *pName )
{
	::StringCbCopy( m_Name, sizeof(m_Name), pName );
}

//-----------------------------------------------------------------------------------
/**
*/
//-----------------------------------------------------------------------------------
CResourceObjectMgr::~CResourceObjectMgr()
{
	Log_TableBegin();
	Log_PrintCellTitle( 0x0000FF, "ÉäÅ[ÉN" );
	Log_PrintCellKind( m_Name );
	Log_CellBegin( 0 );

	Log_PrintLine( 0x000000, "écêî : %d", GetCount() );

	Log_CellEnd();
	Log_TableEnd();
	Log_TableLine( 1 );
}

