

//-----------------------------------------------------------------------------------
// INCLUDE
//-----------------------------------------------------------------------------------
#include "Class/Common/Render/2D/CPrimitive2DBaseMgr.h"
#include "Class/Common/Render/2D/CPrimitive2DBase.h"


//-----------------------------------------------------------------------------------
// NAMESPACE
//-----------------------------------------------------------------------------------
using namespace Selene;
using namespace Renderer;
using namespace Object;


//-----------------------------------------------------------------------------------
/**
*/
//-----------------------------------------------------------------------------------
CPrimitive2DBaseMgr::CPrimitive2DBaseMgr( CRender *pRender ) : CRenderObjectMgr( pRender, "2Dプリミティブ" )
{
}


//-----------------------------------------------------------------------------------
/**
*/
//-----------------------------------------------------------------------------------
CPrimitive2DBaseMgr::~CPrimitive2DBaseMgr()
{
}


//-----------------------------------------------------------------------------------
/**
*/
//-----------------------------------------------------------------------------------
void CPrimitive2DBaseMgr::SetScissoring( Math::Rect2DF *pRect )
{
	CBaseObject *pObj = GetTop();
	while ( pObj != NULL )
	{
		((CPrimitive2DBase*)pObj)->SetScissoring( pRect );

		pObj = pObj->GetNext();
	}
}



